# Дана строка, состоящая из русских слов, набранных заглавными буквами и
# разделенных пробелами (одним или несколькими). Найти количество слов, которые
# содержат ровно три буквы «А».
words = input("Введите слова заглавными буквами через пробел: ")
words.split()
print(words.count("ААА"))
