# Даны строки S, S1 и S2. Заменить в строке S первое вхождение строки S1 на строку
# S2.
S = str(input("Введите строку S: "))
S1 = str(input("Введите строку S1: "))
S2 = str(input("Введите строку S2: "))
print(S.replace(S1, S2))
